## Plan Result (650: prod_app_registrations - TerraformPlanApply)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-repo:hmcts/acr-base-importer:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-repo:hmcts/acr-base-importer:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPull-/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPull-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPush-/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPush-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["DTS Platform Operations GitHub Actions ACR Publisher 2"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Platform Operations GitHub Actions ACR Publisher 2"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS Platform Operations GitHub Actions ACR Publisher 2-repo:hmcts/acr-base-importer:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__acr-base-importer_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/acr-base-importer:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["DTS Platform Operations GitHub Actions ACR Publisher 2-repo:hmcts/acr-base-importer:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__acr-base-importer_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/acr-base-importer:ref:refs/heads/master"
    }

  # module.this.azuread_service_principal.this["DTS Platform Operations GitHub Actions ACR Publisher 2"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.this.azurerm_role_assignment.this["DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPull-/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPull-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPush-/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS Platform Operations GitHub Actions ACR Publisher 2-AcrPush-/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ app_registrations = {
      + "DTS Platform Operations GitHub Actions ACR Publisher 2" = {
          + application_id    = (known after apply)
          + display_name      = "DTS Platform Operations GitHub Actions ACR Publisher 2"
          + id                = (known after apply)
          + object_id         = (known after apply)
          + owners            = [
              + "dad693c4-36ad-468f-94e9-76faa4bc844b",
            ]
          + publisher_domain  = (known after apply)
          + service_principal = {
              + application_id        = (known after apply)
              + application_tenant_id = (known after apply)
              + id                    = (known after apply)
              + object_id             = (known after apply)
            }
        }
        # (17 unchanged elements hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["DTS Developers GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "e6a8e20a-602b-496f-a448-ba9cacaa7f34"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_application.this["DTS Developers GitHub Actions ACR Publisher 2"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "91919d37-236a-47d6-868e-38132df42751"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_application.this["DTS Developers GitHub Actions ACR Publisher 3"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "cc60e2aa-cf95-4437-a177-0d0847a25f5d"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_application.this["DTS Platform Operations GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "70ac6089-a6d1-4c7c-8f0d-b0079b71fa14"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_application.this["DTS Shared GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "94717acc-85d3-42be-b891-63c22ed75b03"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Developers GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "38802ca7-82ed-40f3-9a52-9d61ac6372c1"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Developers GitHub Actions ACR Publisher 2"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "ed61517c-7d9c-4029-89da-aa3188eadf98"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Developers GitHub Actions ACR Publisher 3"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "fa695e39-317e-4246-8415-c91781b5665f"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Platform Operations GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "635e2d9e-c12e-4035-af74-955a9fc380ea"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS Shared GitHub Actions ACR Publisher 1"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "9a5a8d6f-c926-46e3-89d4-ed3472ea0edc"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



## :warning: Errors

* failed to add a label 650: prod_app_registrations - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":76,"Program":"tfcmt","SHA1":"","Target":"650: prod_app_registrations - TerraformPlanApply","Vars":{}} -->